src/test/java/com/structurizr/export/d2/36141-Components.d2
container_4: {
  label: "Mainframe Banking System\n[Software System]"
  shape: rectangle
  style: {
    fill: "#999999"
    stroke: "#6b6b6b"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}
container_17: {
  label: "Single-Page Application\n[Container: JavaScript and Angular]"
  shape: rectangle
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}
container_6: {
  label: "E-mail System\n[Software System]"
  shape: rectangle
  style: {
    fill: "#999999"
    stroke: "#6b6b6b"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}
container_18: {
  label: "Mobile App\n[Container: Xamarin]"
  shape: rectangle
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}
container_21: {
  label: "Database\n[Container: Oracle Database Schema]"
  shape: cylinder
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}

container_20: {
  label: "API Application\n[Container: Java and Spring MVC]"
  shape: rectangle
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
  container_29: {
    label: "Sign In Controller\n[Component: Spring MVC Rest Controller]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_30: {
    label: "Accounts Summary Controller\n[Component: Spring MVC Rest Controller]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_31: {
    label: "Reset Password Controller\n[Component: Spring MVC Rest Controller]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_32: {
    label: "Security Component\n[Component: Spring Bean]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_33: {
    label: "Mainframe Banking System Facade\n[Component: Spring Bean]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_34: {
    label: "E-mail Component\n[Component: Spring Bean]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
}
container_17 -> container_20.container_29 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_17 -> container_20.container_31 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_17 -> container_20.container_30 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_18 -> container_20.container_29 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_18 -> container_20.container_31 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_18 -> container_20.container_30 {
  label: "Makes API calls to\n[JSON/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_29 -> container_20.container_32 {
  label: "Uses"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_30 -> container_20.container_33 {
  label: "Uses"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_31 -> container_20.container_32 {
  label: "Uses"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_31 -> container_20.container_34 {
  label: "Uses"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_32 -> container_21 {
  label: "Reads from and writes to\n[JDBC]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_33 -> container_4 {
  label: "Uses\n[XML/HTTPS]"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_34 -> container_6 {
  label: "Sends e-mail using"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
